aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Middleware/ARM/trusted-firmware-m/platform/ext/target/arm/mps3/corstone_polaris/device/include/platform_regs.h
/* MAIN PPCEXP3 peripherals definition */
/* End MAIN PPCEXP3 peripherals definition */

/* PERIPH PPC0 peripherals definition */
#define SYSTEM_TIMER0_PERIPH_PPC0_POS_MASK         (1UL << 0)
#define SYSTEM_TIMER1_PERIPH_PPC0_POS_MASK         (1UL << 1)
#define SYSTEM_TIMER2_PERIPH_PPC0_POS_MASK         (1UL << 2)
#define SYSTEM_TIMER3_PERIPH_PPC0_POS_MASK         (1UL << 5)
#define WATCHDOG_PERIPH_PPC0_POS_MASK              (1UL << 6)
/* There are separate secure and non-secure watchdog peripherals, so this bit
 * can only be used in the unprivileged access registers. */
/* End PERIPH PPC0 peripherals definition */

/* PERIPH PPC1 peripherals definition */
#define SLOWCLK_TIMER_PERIPH_PPC1_POS_MASK         (1UL << 0)
/* End PERIPH PPC1 peripherals definition */

/* PERIPH PPCEXP0 peripherals definition */
#define USER_MEM_APB0_PERIPH_PPCEXP0_POS_MASK      (1UL << 0)
#define USER_MEM_APB1_PERIPH_PPCEXP0_POS_MASK      (1UL << 1)
#define NPU_APB0_PERIPH_PPCEXP0_POS_MASK           (1UL << 4)
#define NPU_APB1_PERIPH_PPCEXP0_POS_MASK           (1UL << 5)
#define MPC_SRAM_PERIPH_PPCEXP0_POS_MASK           (1UL << 13)
#define MPC_QSPI_PERIPH_PPCEXP0_POS_MASK           (1UL << 14)
#define MPC_DDR4_PERIPH_PPCEXP0_POS_MASK           (1UL << 15)
/* End PERIPH PPCEXP0 peripherals definition */

/* PERIPH PPCEXP1 peripherals definition */
#define FPGA_I2C_TOUCH_PERIPH_PPCEXP1_POS_MASK     (1UL << 0)
#define FPGA_I2C_AUDIO_PERIPH_PPCEXP1_POS_MASK     (1UL << 1)
#define FPGA_SPI_ADC_PERIPH_PPCEXP1_POS_MASK       (1UL << 2)
#define FPGA_SPI_SHIELD0_PERIPH_PPCEXP1_POS_MASK   (1UL << 3)
#define FPGA_SPI_SHIELD1_PERIPH_PPCEXP1_POS_MASK   (1UL << 4)
#define SBCon_I2C_SHIELD0_PERIPH_PPCEXP1_POS_MASK  (1UL << 5)
#define SBCon_I2C_SHIELD1_PERIPH_PPCEXP1_POS_MASK  (1UL << 6)
#define FPGA_SBCon_I2C_PERIPH_PPCEXP1_POS_MASK     (1UL << 8)
/* End PERIPH PPCEXP1 peripherals definition */

/* PERIPH PPCEXP2 peripherals definition */
#define FPGA_SCC_PERIPH_PPCEXP2_POS_MASK           (1UL << 0)
#define FPGA_I2S_PERIPH_PPCEXP2_POS_MASK           (1UL << 1)
#define FPGA_IO_PERIPH_PPCEXP2_POS_MASK            (1UL << 2)
#define UART0_PERIPH_PPCEXP2_POS_MASK              (1UL << 3)
#define UART1_PERIPH_PPCEXP2_POS_MASK              (1UL << 4)
#define UART2_PERIPH_PPCEXP2_POS_MASK              (1UL << 5)
#define UART3_PERIPH_PPCEXP2_POS_MASK              (1UL << 6)
#define UART4_PERIPH_PPCEXP2_POS_MASK              (1UL << 7)
#define UART5_PERIPH_PPCEXP2_POS_MASK              (1UL << 8)
#define CLCD_PERIPH_PPCEXP2_POS_MASK               (1UL << 10)
#define RTC_PERIPH_PPCEXP2_POS_MASK                (1UL << 11)
/* End PERIPH PPCEXP2 peripherals definition */

/* PERIPH PPCEXP3 peripherals definition */
/* End PERIPH PPCEXP3 peripherals definition */

struct cpu0_pwrctrl_t {
    volatile uint32_t cpupwrcfg;      /* 0x000 (R/W) CPU 0 Local Power
                                       *             Configuration */
    volatile uint32_t reserved0[1011];
    volatile uint32_t pidr4;          /* 0xFD0 (R/ ) Peripheral ID 4 */
    volatile uint32_t reserved1[3];
    volatile uint32_t pidr0;          /* 0xFE0 (R/ ) Peripheral ID 0 */
    volatile uint32_t pidr1;          /* 0xFE4 (R/ ) Peripheral ID 1 */
    volatile uint32_t pidr2;          /* 0xFE8 (R/ ) Peripheral ID 2 */
    volatile uint32_t pidr3;          /* 0xFEC (R/ ) Peripheral ID 3 */
    volatile uint32_t cidr0;          /* 0xFF0 (R/ ) Component ID 0 */
    volatile uint32_t cidr1;          /* 0xFF4 (R/ ) Component ID 1 */
    volatile uint32_t cidr2;          /* 0xFF8 (R/ ) Component ID 2 */
    volatile uint32_t cidr3;          /* 0xFFC (R/ ) Component ID 3 */
};

struct cpu0_secctrl_t {
    volatile uint32_t cpuseccfg;      /* 0x000 (R/W) CPU Local Security
                                       *             Configuration */
    volatile uint32_t reserved0[1011];
    volatile uint32_t pidr4;          /* 0xFD0 (R/ ) Peripheral ID 4 */
    volatile uint32_t reserved1[3];
    volatile uint32_t pidr0;          /* 0xFE0 (R/ ) Peripheral ID 0 */
    volatile uint32_t pidr1;          /* 0xFE4 (R/ ) Peripheral ID 1 */
    volatile uint32_t pidr2;          /* 0xFE8 (R/ ) Peripheral ID 2 */
    volatile uint32_t pidr3;          /* 0xFEC (R/ ) Peripheral ID 3 */
    volatile uint32_t cidr0;          /* 0xFF0 (R/ ) Component ID 0 */
    volatile uint32_t cidr1;          /* 0xFF4 (R/ ) Component ID 1 */
    volatile uint32_t cidr2;          /* 0xFF8 (R/ ) Component ID 2 */
    volatile uint32_t cidr3;          /* 0xFFC (R/ ) Component ID 3 */
};

struct polaris_sysinfo_t {
    volatile uint32_t soc_identity;   /* 0x000 (R/ ) SoC Identity Register */
    volatile uint32_t sys_config0;    /* 0x004 (R/ ) System Hardware
                                       *             Configuration 0 */
    volatile uint32_t sys_config1;    /* 0x008 (R/ ) System Hardware
                                       *             Configuration 1 */
    volatile uint32_t reserved0[1006];
    volatile uint32_t iidr;           /* 0xFC8 (R/ ) Subsystem Implementation
                                       *             Identity */
    volatile uint32_t reserved1;
    volatile uint32_t pidr4;          /* 0xFD0 (R/ ) Peripheral ID 4 */
    volatile uint32_t reserved2[3];
    volatile uint32_t pidr0;          /* 0xFE0 (R/ ) Peripheral ID 0 */
    volatile uint32_t pidr1;          /* 0xFE4 (R/ ) Peripheral ID 1 */
    volatile uint32_t pidr2;          /* 0xFE8 (R/ ) Peripheral ID 2 */
    volatile uint32_t pidr3;          /* 0xFEC (R/ ) Peripheral ID 3 */
    volatile uint32_t cidr0;          /* 0xFF0 (R/ ) Component ID 0 */
    volatile uint32_t cidr1;          /* 0xFF4 (R/ ) Component ID 1 */
    volatile uint32_t cidr2;          /* 0xFF8 (R/ ) Component ID 2 */
    volatile uint32_t cidr3;          /* 0xFFC (R/ ) Component ID 3 */
};

struct polaris_sysctrl_t {
    volatile uint32_t secdbgstat;        /* 0x000 (R/ ) Secure Debug
                                          *             Configuration Status */
    volatile uint32_t secdbgset;         /* 0x004 (R/W) Secure Debug
                                          *             Configuration Set */
    volatile uint32_t secdbgclr;         /* 0x008 ( /W) Secure Debug
                                          *             Configuration Clear */
    volatile uint32_t scsecctrl;         /* 0x00C (R/W) System Control Security
                                          *             Controls */
    volatile uint32_t clk_cfg0;          /* 0x010 (R/W) Clock Configuration 0 */
    volatile uint32_t clk_cfg1;          /* 0x014 (R/W) Clock Configuration 1 */
    volatile uint32_t clock_force;       /* 0x018 (R/W) Clock Forces */
    volatile uint32_t reserved0[57];
    volatile uint32_t reset_syndrome;    /* 0x100 (R/W) Reset syndrome */
    volatile uint32_t reset_mask;        /* 0x104 (R/W) Reset mask */
    volatile uint32_t swreset;           /* 0x108 ( /W) Software Reset */
    volatile uint32_t gretreg;           /* 0x10C (R/W) General Purpose
                                          *             Retention */
    volatile uint32_t initsvtor0;        /* 0x110 (R/W) CPU 0 Initial Secure
                                          *             Reset Vector Register */
    volatile uint32_t reserved1[3];
    volatile uint32_t cpuwait;           /* 0x120 (R/W) CPU Boot Wait Control */
    volatile uint32_t nmi_enable;        /* 0x124 (R/W) Non Maskable Interrupts
                                          *             Enable */
    volatile uint32_t reserved2[53];
    volatile uint32_t pwrctrl;           /* 0x1FC (R/W) Power Configuration and
                                          *             Control */
    volatile uint32_t pdcm_pd_sys_sense; /* 0x200 (R/W) PDCM PD_SYS
                                          *             Sensitivity */
    volatile uint32_t pdcm_pd_cpu0_sense;/* 0x204 (R/ ) PDCM PD_CPU0
                                          *             Sensitivity */
    volatile uint32_t reserved3[3];
    volatile uint32_t pdcm_pd_vmr0_sense;/* 0x214 (R/W) PDCM PD_VMR0
                                          *             Sensitivity */
    volatile uint32_t pdcm_pd_vmr1_sense;/* 0x218 (R/W) PDCM PD_VMR1
                                          *             Sensitivity */
    volatile uint32_t reserved4[877];
    volatile uint32_t pidr4;             /* 0xFD0 (R/ ) Peripheral ID 4 */
    volatile uint32_t reserved5[3];
    volatile uint32_t pidr0;             /* 0xFE0 (R/ ) Peripheral ID 0 */
    volatile uint32_t pidr1;             /* 0xFE4 (R/ ) Peripheral ID 1 */
    volatile uint32_t pidr2;             /* 0xFE8 (R/ ) Peripheral ID 2 */
    volatile uint32_t pidr3;             /* 0xFEC (R/ ) Peripheral ID 3 */
    volatile uint32_t cidr0;             /* 0xFF0 (R/ ) Component ID 0 */
    volatile uint32_t cidr1;             /* 0xFF4 (R/ ) Component ID 1 */
    volatile uint32_t cidr2;             /* 0xFF8 (R/ ) Component ID 2 */
    volatile uint32_t cidr3;             /* 0xFFC (R/ ) Component ID 3 */
};

struct polaris_ewic_t {
    volatile uint32_t ewic_cr;        /* 0x000 (R/W) EWIC Control */
    volatile uint32_t ewic_ascr;      /* 0x004 (R/W) Automatic Sequence
                                       *             Control */
    volatile uint32_t ewic_clrmask;   /* 0x008 ( /W) Clear All Mask */
    volatile uint32_t ewic_numid;     /* 0x00C (R/ ) ID Register for the number
                                       *             of events supported */
    volatile uint32_t reserved0[124];
    volatile uint32_t ewic_maska;     /* 0x200 (R/W) Set which internal events
                                       *             cause wakeup */
    volatile uint32_t ewic_mask[15];  /* 0x204 (R/W) Set which external
                                       *             interrupts cause wakeup
                                       *             Only the first (total
                                       *             system IRQ number)/32
                                       *             registers are implemented
                                       *             in array */
    volatile uint32_t reserved1[112];
    volatile uint32_t ewic_penda;     /* 0x400 (R/ ) Shows which internal
                                       *             interrupts were pended
                                       *             while the EWIC was
                                       *             enabled */

    volatile uint32_t ewic_pend[15];   /* 0x404 (R/W) Shows which external
                                       *             interrupts were pended
                                       *             while the EWIC was
                                       *             enabled
                                       *             Only the first (total
                                       *             system IRQ number)/32
                                       *             registers are implemented
                                       *             in array */
    volatile uint32_t reserved2[112];
    volatile uint32_t ewic_psr;       /* 0x600 (R/ ) Pending Summary */
    volatile uint32_t reserved3[575];
    volatile uint32_t itctrl;         /* 0xF00 (R/ ) Integration Mode Control */
    volatile uint32_t reserved4[39];
    volatile uint32_t claimset;       /* 0xFA0 (R/W) Claim Tag Set */
    volatile uint32_t claimclr;       /* 0xFA4 (R/W) Claim Tag Clear */
    volatile uint32_t devaff0;        /* 0xFA8 (R/ ) Device Affinity 0 */
    volatile uint32_t devaff1;        /* 0xFAC (R/ ) Device Affinity 1 */
    volatile uint32_t lar;            /* 0xFB0 ( /W) Lock Access */
    volatile uint32_t lsr;            /* 0xFB4 (R/ ) Lock Status */
    volatile uint32_t authstatus;     /* 0xFB8 (R/ ) Authentication Status */
    volatile uint32_t devarch;        /* 0xFBC (R/ ) Device Architecture */
    volatile uint32_t devid2;         /* 0xFC0 (R/ ) Device Configuration 2 */
    volatile uint32_t devid1;         /* 0xFC4 (R/ ) Device Configuration 1 */
    volatile uint32_t devid;          /* 0xFC8 (R/ ) Device Configuration */
    volatile uint32_t devtype;        /* 0xFCC (R/ ) Device Type */
    volatile uint32_t pidr4;          /* 0xFD0 (R/ ) Peripheral ID 4 */
    volatile uint32_t reserved5[3];
    volatile uint32_t pidr0;          /* 0xFE0 (R/ ) Peripheral ID 0 */
    volatile uint32_t pidr1;          /* 0xFE4 (R/ ) Peripheral ID 1 */
    volatile uint32_t pidr2;          /* 0xFE8 (R/ ) Peripheral ID 2 */
    volatile uint32_t pidr3;          /* 0xFEC (R/ ) Peripheral ID 3 */
    volatile uint32_t cidr0;          /* 0xFF0 (R/ ) Component ID 0 */
    volatile uint32_t cidr1;          /* 0xFF4 (R/ ) Component ID 1 */
    volatile uint32_t cidr2;          /* 0xFF8 (R/ ) Component ID 2 */
    volatile uint32_t cidr3;          /* 0xFFC (R/ ) Component ID 3 */
};
#endif /* __PLATFORM_REGS_H__ */
